sbh-ship/AI-ESP32-CAMERA/firmware/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "Arduino.h"
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include <WiFi.h>

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

static bool adaptive_stream = true;
static uint8_t manual_stream_fps = 14;
static uint8_t active_stream_fps = 14;
static framesize_t manual_framesize = FRAMESIZE_HD;
static framesize_t active_framesize = FRAMESIZE_HD;
static int manual_quality = 10;
static int active_quality = 10;
static int last_wifi_rssi = -127;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static bool camera_ap_active() {
  return (WiFi.getMode() & WIFI_AP) != 0;
}

static String camera_ip_string() {
  if (camera_ap_active()) {
    return WiFi.softAPIP().toString();
  }
  if (WiFi.status() == WL_CONNECTED) {
    return WiFi.localIP().toString();
  }
  return String("0.0.0.0");
}

static String camera_ssid_string() {
  if (camera_ap_active()) {
    return WiFi.softAPSSID();
  }
  if (WiFi.status() == WL_CONNECTED) {
    return WiFi.SSID();
  }
  return String("offline");
}

static int clamp_int(int value, int low, int high) {
  if (value < low) {
    return low;
  }
  if (value > high) {
    return high;
  }
  return value;
}

static framesize_t min_framesize(framesize_t requested, framesize_t max_allowed) {
  return requested > max_allowed ? max_allowed : requested;
}

static void apply_stream_profile(sensor_t *s, framesize_t framesize, int quality, uint8_t fps_limit) {
  if (s == NULL) {
    return;
  }

  if (s->pixformat == PIXFORMAT_JPEG && s->status.framesize != framesize) {
    s->set_framesize(s, framesize);
  }
  if (s->status.quality != quality) {
    s->set_quality(s, quality);
  }

  active_framesize = framesize;
  active_quality = quality;
  active_stream_fps = fps_limit;
}

void cameraServerHousekeeping(bool force) {
  static uint32_t last_run = 0;
  const uint32_t now = millis();

  if (!force && (now - last_run < 3000)) {
    return;
  }
  last_run = now;

  sensor_t *s = esp_camera_sensor_get();
  if (s == NULL) {
    return;
  }

  framesize_t target_framesize = manual_framesize;
  int target_quality = manual_quality;
  uint8_t target_fps = manual_stream_fps;

  if (camera_ap_active()) {
    last_wifi_rssi = 0;
  } else if (WiFi.status() == WL_CONNECTED) {
    last_wifi_rssi = WiFi.RSSI();
  } else {
    last_wifi_rssi = -127;
  }

  if (adaptive_stream && !camera_ap_active() && WiFi.status() == WL_CONNECTED) {
    if (last_wifi_rssi <= -78) {
      target_framesize = min_framesize(manual_framesize, FRAMESIZE_VGA);
      target_quality = manual_quality < 16 ? 16 : manual_quality;
      target_fps = manual_stream_fps > 8 ? 8 : manual_stream_fps;
    } else if (last_wifi_rssi <= -70) {
      target_framesize = min_framesize(manual_framesize, FRAMESIZE_VGA);
      target_quality = manual_quality < 14 ? 14 : manual_quality;
      target_fps = manual_stream_fps > 10 ? 10 : manual_stream_fps;
    } else if (last_wifi_rssi <= -63) {
      target_framesize = min_framesize(manual_framesize, FRAMESIZE_SVGA);
      target_quality = manual_quality < 12 ? 12 : manual_quality;
      target_fps = manual_stream_fps > 12 ? 12 : manual_stream_fps;
    }
  }

  apply_stream_profile(s, target_framesize, target_quality, target_fps);
}

